In [1]:
import pandas as pd
import numpy as np
from numpy.random import default_rng
rng = default_rng()

## Series

Given the Series below:

In [3]:
s = pd.Series(np.arange(5),index=list("abcde"))
s

a    0
b    1
c    2
d    3
e    4
dtype: int64

without entering the statements:

- predict the values and the type of object returned for each statement:

In [4]:
s['d']        # 4, type int
s['b':'d']    # 1, 2, 3, type int
s[2::2][::-1] # 4, 2, type int
s[['b', 'a']] # 1, 0, type int

b    1
a    0
dtype: int64

- predict the contents of `s`, `s1` and `lst`:

In [9]:
lst, idx = np.arange(5), list("abcde")
s = pd.Series(lst,idx)
s
# s[-1:] = 10               # [0, 1, 2, 3, 10], type int
# lst[0] = 5                # [5, 1, 2, 3, 4], type int
# s1 = pd.Series(s.copy())  # [5, 1, 2, 3, 4], type int
# s1[0] = -1                # [5, 1, 2, 3, 4], type int

a    0
b    1
c    2
d    3
e    4
dtype: int64

- predict the result of the operations

In [18]:
s1 = pd.Series({'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4})
s2 = pd.Series({'d': 0, 'e': 1, 'f': 2, 'g': 3})
print(s1)
print(s2)

s1 + s2           # NaN, NaN, NaN, 3, 5, NaN, NaN, type float
s1[3:] * s2[:-2]  # 0, 4, type int

a    0
b    1
c    2
d    3
e    4
dtype: int64
d    0
e    1
f    2
g    3
dtype: int64

d    0
e    4
dtype: int64

## DataFrame

Given the DataFrame `df` below:

In [20]:
rng = default_rng(1234)
df = pd.DataFrame(np.array(rng.standard_normal(25)).reshape(5,5),
             index=[1, 0, 4, 3, 2], columns=list("abcde"))
df

          a         b         c         d         e
1 -1.603837  0.064100  0.740891  0.152619  0.863744
0  2.913099 -1.478823  0.945473 -1.666135  0.343745
4 -0.512444  1.323759 -0.860280  0.519493 -1.265144
3 -2.159139  0.434734  1.733289  0.520134 -1.002166
2  0.268346  0.767175  1.191272 -1.157411  0.696279

retrieve:
- 2nd row as a Series
- 3rd row as a DataFrame
- rows on even positions
- rows with even indices
- 3d column
- odd (index) rows and columns 'b' to 'd'

In [22]:
# 2nd row as a Series
print(df.iloc[1])

# 3rd row as a DataFrame
print(df.iloc[2:3])

# rows on even positions
print(df.iloc[::2])

# rows with even indices
print(df.loc[df.index % 2 == 0])

# 3d column
print(df.iloc[:, 2])

# odd (index) rows and columns 'b' to 'd'
df.loc[df.index % 2 == 1, 'b':'d']

a    2.913099
b   -1.478823
c    0.945473
d   -1.666135
e    0.343745
Name: 0, dtype: float64
          a         b        c         d         e
4 -0.512444  1.323759 -0.86028  0.519493 -1.265144
          a         b         c         d         e
1 -1.603837  0.064100  0.740891  0.152619  0.863744
4 -0.512444  1.323759 -0.860280  0.519493 -1.265144
2  0.268346  0.767175  1.191272 -1.157411  0.696279
          a         b         c         d         e
0  2.913099 -1.478823  0.945473 -1.666135  0.343745
4 -0.512444  1.323759 -0.860280  0.519493 -1.265144
2  0.268346  0.767175  1.191272 -1.157411  0.696279
1    0.740891
0    0.945473
4   -0.860280
3    1.733289
2    1.191272
Name: c, dtype: float64

          b         c         d
1  0.064100  0.740891  0.152619
3  0.434734  1.733289  0.520134

### Merge DataFrames

Given `df1`, `df2` and `df3` apply the following:

- merge df1 and df2 side by side
- merge df1 and df3 stacked
- merge all and reset index

In [23]:
df1 = pd.DataFrame({'name': ['ants', 'bees','wasps'] , 'order':['Hymenoptera']*3})
df2 = pd.DataFrame({'name': ['beetles', 'weevils'] , 'order':['Coleoptera']*2})
df3 = pd.DataFrame({'name': ['butterflies', 'moths'], 'order':['Lepidoptera']*2 })

In [24]:
df1

    name        order
0   ants  Hymenoptera
1   bees  Hymenoptera
2  wasps  Hymenoptera

In [25]:
df2

      name       order
0  beetles  Coleoptera
1  weevils  Coleoptera

In [26]:
df3

          name        order
0  butterflies  Lepidoptera
1        moths  Lepidoptera

In [27]:
# merge df1 and df2 side by side
pd.concat([df1, df2], axis=1)

    name        order     name       order
0   ants  Hymenoptera  beetles  Coleoptera
1   bees  Hymenoptera  weevils  Coleoptera
2  wasps  Hymenoptera      NaN         NaN

In [28]:
# merge df1 and df3 stacked
pd.concat([df1, df3])

          name        order
0         ants  Hymenoptera
1         bees  Hymenoptera
2        wasps  Hymenoptera
0  butterflies  Lepidoptera
1        moths  Lepidoptera

In [29]:
# merge all and reset index
pd.concat([df1, df2, df3], ignore_index=True)

          name        order
0         ants  Hymenoptera
1         bees  Hymenoptera
2        wasps  Hymenoptera
3      beetles   Coleoptera
4      weevils   Coleoptera
5  butterflies  Lepidoptera
6        moths  Lepidoptera

### Missing values

Given the following DataFrame

In [31]:
df = pd.DataFrame(np.arange(25).reshape(5,5))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

set the values to NaN as such to reproduce the following DataFrame:

In [33]:
# ...

Apply the following on the dataframe with missing values created in the previous step.

Drop missing:
- rows with missing values
- columns with missing values
- rows where all values are missing
- columns where all values are missing

Fill missing:
- with 0
- with mean based on column values
- with median based on row values

In [ ]:
# ...

### Natural gas consumption in the Netherlands

The dataset can be downloaded from [CBS Open data StatLine](https://opendata.cbs.nl/statline/portal.html?_la=en&_catalog=CBS). A version is already included in the data directory of this session's git repository. We will be using this dataset in the exercises to prepare for visualisation later on in the course.

We first read the data with `pd.read_csv`. Here we only select the columns `Periods` and `TotalSupply_1`:

In [35]:
cbs = pd.read_csv("data/00372eng_UntypedDataSet_17032023_161051.csv",sep=";")
df0 = cbs[['Periods','TotalSupply_1']].copy()
df0

      Periods  TotalSupply_1
0    1946JJ00              0
1    1947JJ00              1
2    1948JJ00              5
3    1949JJ00              7
4    1950JJ00              5
..        ...            ...
730  2022MM12           3812
731  2022KW04           8521
732  2022JJ00          31227
733  2023MM01           3386
734  2023MM02           3057

[735 rows x 2 columns]

The column `Periods`has the year (yyyy) followed by a tag {JJ,KW,MM} representing the yearly, quarterly and monthly terms respectively, and finally ending with two digits `00..12`. The two digit followed by the tags have different meaning per tag. For JJ it is always `00`, MM with `00..12` for 12 months and `KW`  with  `01..04` for four quarters. The column `TotaalAanbod_1` holds the natural gas consumption (MCM).

In order to get more control over the date ranges we will need to split the string based on the pattern `YYYY{MM,KW,JJ}{00,...,12}`. The Series class has a comprehensive set of submodules, one of which being `pandas.Series.str` with the method `split`. The `split` method takes a [regular expression](https://docs.python.org/3/library/re.html) describing the pattern and  splits the string based on the pattern. Regular expressions fall beyond the scope of this course, therefore the solution is given here for the exercise.

In [36]:
df = df0.Periods.str.split(r'(JJ|MM|KW)', regex=True, expand=True)  # expand=True forces the result into
                                                                        # a DataFrame
df = pd.DataFrame({'year': df[0].astype(int),                 # Create DataFrame {year,term,idx}
                        'term': df[1],
                        'idx': df[2].astype(int)})

df = pd.concat([df,cbs[['TotalSupply_1']]],axis=1)
df

     year term  idx  TotalSupply_1
0    1946   JJ    0              0
1    1947   JJ    0              1
2    1948   JJ    0              5
3    1949   JJ    0              7
4    1950   JJ    0              5
..    ...  ...  ...            ...
730  2022   MM   12           3812
731  2022   KW    4           8521
732  2022   JJ    0          31227
733  2023   MM    1           3386
734  2023   MM    2           3057

[735 rows x 4 columns]

1) Write a function given a Series with {year,term,idx} returns a timestamp according to the following specification:

```
JJ : yyyyJJ00 => 31-12-yyyy
KW : yyyyKWmm => where mm in {1,2,3,4}
                 01: 1-1-yyyy to 31-3-yyyy
                 02: 1-4-yyyy to 30-6-yyyy
                 03: 1-7-yyyy to 30-9-yyyy
                 04: 1-10-yyyy to 31-12-yyyy
MM : yyyyMMmm => dd-mm-yyyy where dd is the last day of the month and
                 mm in {1,..,12}
```

2) Create a new DataFrame called `ngc` (natural gas consumption) with three columns {term, date, consumption} :
- term : {JJ,KW,MM}
- date : timestamps as specified in the previous exercise
- consumption: which is `TotalSupply_1` only renamed

In [38]:
# function to convert {year,term,idx} to timestamp
def convert_to_timestamp(s):
    if s.term == 'JJ':
        return pd.to_datetime(f'31-12-{s.year}')
    if s.term == 'KW':
        if s.idx == 1:
            return pd.to_datetime(f'1-1-{s.year}')
        if s.idx == 2:
            return pd.to_datetime(f'1-4-{s.year}')
        if s.idx == 3:
            return pd.to_datetime(f'1-7-{s.year}')
        if s.idx == 4:
            return pd.to_datetime(f'1-10-{s.year}')
    if s.term == 'MM':
        return pd.to_datetime(f'1-{s.idx+1}-{s.year}') - pd.DateOffset(days=1)

# create ngc
ngc = pd.DataFrame({'term': df.term,
                    'date': df.apply(convert_to_timestamp, axis=1),
                    'consumption': df.TotalSupply_1})
ngc

/var/folders/cg/m_jx2c8j1qv5_vy5_shhn8vw0000gn/T/ipykernel_52062/4254518445.py:4: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  return pd.to_datetime(f'31-12-{s.year}')

    term       date  consumption
0     JJ 1946-12-31            0
1     JJ 1947-12-31            1
2     JJ 1948-12-31            5
3     JJ 1949-12-31            7
4     JJ 1950-12-31            5
..   ...        ...          ...
730   MM 2022-01-12         3812
731   KW 2022-01-10         8521
732   JJ 2022-12-31        31227
733   MM 2023-01-01         3386
734   MM 2023-01-02         3057

[735 rows x 3 columns]

Validate entries in the ngc DataFrame from the previous step:
- whether sum of 3 months consumptions are equal to the corresponding quarterly entries(KW)
- whether sum of 4 quarters addup to the yearly (JJ) entries

In [46]:
# check whether sum of 3 months consumptions are equal to the corresoinding quarterly entires (KW)
ngc['consumption'].groupby([ngc.date.dt.year, ngc.date.dt.quarter]).sum()

date  date
1946  4           0
1947  4           1
1948  4           5
1949  4           7
1950  4           5
              ...
2021  1       80266
      4       40134
2022  1       62454
      4       31227
2023  1        6443
Name: consumption, Length: 119, dtype: int64

In [47]:
cbs['TotalSupply_1'].groupby([cbs.Periods.str.split(r'(JJ|MM|KW)', regex=True, expand=True)[0].astype(int),
                              cbs.Periods.str.split(r'(JJ|MM|KW)', regex=True, expand=True)[2].astype(int)]).sum()

0     2
1946  0        0
1947  0        1
1948  0        5
1949  0        7
1950  0        5
            ...
2022  10    2094
      11    2616
      12    3812
2023  1     3386
      2     3057
Name: TotalSupply_1, Length: 571, dtype: int64